{
  "palette": {
    "CMAunp": "#FDE725FF",
    "CWHdm": "#472D7BFF",
    "CWHds1": "#21908CFF",
    "CWHms1": "#27AD81FF",
    "CWHvm1": "#2C728EFF",
    "CWHvm2": "#3B528BFF",
    "CWHxm1": "#440154FF",
    "MHmm1": "#5DC863FF",
    "MHmm2": "#AADC32FF"
  },
  "taxa": {
    "CMAunp": "Abies amabilis, Abies lasiocarpa, Acer circinatum, Achillea millefolium, Adiantum aleuticum var. aleuticum, Agoseris aurantiaca var. aurantiaca, Agoseris glauca, Agrostis capillaris, Agrostis exarata, Agrostis humilis, Agrostis mertensii, Agrostis scabra, Agrostis variabilis, Alnus alnobetula ssp. sinuata, Alnus rubra, Anaphalis margaritacea, Antennaria alpina, Antennaria media, Antennaria rosea, Antennaria umbrinella, Aquilegia formosa, Arctostaphylos uva-ursi, Arnica gracilis, Arnica lanceolata ssp. prima, Arnica latifolia, Arnica rydbergii, Artemisia norvegica ssp. saxatilis, Askellia pygmaea, Athyrium distentifolium ssp. americanum, Athyrium filix-femina var. cyclosorum, Bistorta vivipara, Boechera calderi, Boechera lyallii, Boechera stricta, Botrychium lanceolatum, Botrychium neolunaria, Brewerimitella breweri, Bromus marginatus, Calamagrostis purpurea, Callitriche palustris, Callitropsis nootkatensis, Caltha leptosepala, Campanula alaskana, Campanula rotundifolia complex, Cardamine pensylvanica, Carex albonigra, Carex foenea, Carex garberi, Carex illota, Carex macrochaeta, Carex mertensii, Carex nardina, Carex nigricans, Carex pachystachya, Carex pauciflora, Carex phaeocephala, Carex preslii, Carex pyrenaica, Carex rossii, Carex scirpoidea, Carex spectabilis, Cassiope mertensiana ssp. mertensiana, Castilleja elmeri, Castilleja hispida var. hispida, Castilleja miniata var. miniata, Castilleja parviflora var. albida, Castilleja parviflora var. parviflora, Castilleja rhexiifolia, Chamaenerion angustifolium, Chamaenerion latifolium, Cherleria biflora, Chimaphila umbellata, Cirsium edule, Claytonia lanceolata, Corallorhiza mertensiana, Corallorhiza trifida, Cryptogramma acrostichoides, Cryptogramma cascadensis, Cystopteris fragilis, Danthonia intermedia, Dicentra formosa ssp. formosa, Diphasiastrum alpinum, Diphasiastrum sitchense, Draba albertina, Draba incerta, Draba lonchocarpa, Draba stenoloba, Elliottia pyroliflora, Elymus elymoides ssp. californicus, Elymus glaucus, Elymus violaceus, Empetrum nigrum, Epilobium anagallidifolium, Epilobium hornemannii, Epilobium luteum, Equisetum arvense, Erigeron acris, Erigeron aureus, Erigeron compositus, Erigeron glacialis, Erigeron nivalis, Erigeron peregrinus, Eriophorum angustifolium, Erythranthe caespitosa, Erythranthe lewisii, Erythronium grandiflorum, Festuca ovina, Gaultheria humifusa, Gaultheria ovatifolia, Gentiana glauca, Gymnocarpium dryopteris, Hemitomes congestum, Heracleum maximum, Heracleum sphondylium, Heuchera glabra, Hieracium albiflorum, Hieracium triste, Holodiscus discolor, Huperzia continentalis, Juncus balticus, Juncus drummondii, Juncus mertensianus, Juncus parryi, Juniperus communis, Kalmia microphylla var. microphylla, Kalmia microphylla var. occidentalis, Kalmia procumbens, Koeleria spicata, Lathyrus japonicus, Leptarrhena pyrolifolia, Lonicera utahensis, Luetkea pectinata, Lupinus arcticus ssp. subalpinus, Lupinus latifolius ssp. latifolius, Lupinus lepidus var. lobbii, Luzula hitchcockii, Luzula parviflora ssp. parviflora, Luzula piperi, Luzula spicata, Luzula wahlenbergii, Lysichiton americanus, Lysimachia latifolia, Micranthes ferruginea, Micranthes lyallii, Micranthes nelsoniana var. cascadensis, Micranthes occidentalis, Micranthes porsildiana, Micranthes tolmiei, Monotropa hypopitys, Monotropa uniflora, Montia parvifolia, Neottia banksiana, Neottia cordata, Nothochelone nemorosa, Nuttallanthus canadensis, Oplopanax horridus, Orthilia secunda, Osmorhiza depauperata, Osmorhiza purpurea, Oxyria digyna, Ozomelis trifida, Packera pauciflora, Parnassia fimbriata, Paxistima myrsinites, Pectiantia pentandra, Pedicularis bracteosa, Pedicularis racemosa, Penstemon davidsonii var. menziesii, Penstemon procerus var. tolmiei, Penstemon serrulatus, Petasites frigidus var. frigidus, Phacelia sericea var. sericea, Phegopteris connectilis, Phleum alpinum, Phlox diffusa ssp. longistylis, Phyllodoce × intermedia, Phyllodoce empetriformis, Phyllodoce glanduliflora, Pinguicula macroceras, Pinus albicaulis, Pinus monticola, Platanthera stricta, Poa alpina, Poa cusickii ssp. epilis, Poa lettermanii, Poa secunda ssp. secunda, Poa stenantha, Polemonium viscosum, Polystichum lonchitis, Polystichum munitum, Potentilla drummondii, Potentilla flabellifolia, Potentilla glaucophylla var. glaucophylla, Potentilla hyparctica, Potentilla uniflora, Potentilla villosa, Prosartes hookeri, Pseudotsuga menziesii var. menziesii, Pulsatilla occidentalis, Pyrola asarifolia ssp. asarifolia, Pyrola asarifolia ssp. bracteata, Pyrola minor, Ranunculus eschscholtzii var. eschscholtzii, Rhododendron albiflorum, Rhododendron menziesii, Ribes acerifolium, Ribes lacustre, Romanzoffia sitchensis, Rubus parviflorus, Rubus spectabilis, Sabulina rubella, Sagina saginoides, Salix arctica, Salix barclayi, Salix commutata, Salix nivalis, Saxifraga bronchialis ssp. austromontana, Saxifraga cespitosa, Saxifraga mertensiana, Sedum divergens, Sedum lanceolatum var. nesioticum, Senecio fremontii var. fremontii, Senecio triangularis, Sibbaldia procumbens, Silene acaulis, Silene parryi, Solidago multiradiata, Spinulum annotinum, Spiraea splendens, Stellaria borealis ssp. borealis, Stellaria calycantha, Stellaria longipes ssp. longipes, Streptopus amplexifolius, Streptopus lanceolatus var. curvipes, Symphyotrichum foliaceum var. foliaceum, Taraxacum alaskanum, Taraxacum erythrospermum agg., Taraxacum officinale agg., Taxus brevifolia, Thuja plicata, Tiarella trifoliata var. unifoliata, Tonestus lyallii, Triantha glutinosa, Triantha occidentalis ssp. brevistyla, Trollius albiflorus, Tsuga heterophylla, Tsuga mertensiana, Vaccinium cespitosum, Vaccinium deliciosum, Vaccinium membranaceum, Vaccinium ovalifolium, Vaccinium uliginosum, Vahlodea atropurpurea, Valeriana sitchensis, Veratrum viride var. eschscholzianum, Veronica wormskjoldii, Viola glabella, Woodsia oregana ssp. oregana",
    "CWHdm": "× Elyhordeum stebbinsianum, Abies grandis, Acer campestre, Acer glabrum var. douglasii, Acer macrophyllum, Achillea filipendulina, Acmispon parviflorus, Actaea rubra, Adenocaulon bicolor, Aegopodium podagraria, Aesculus hippocastanum, Agoseris grandiflora var. leptophylla, Agrostis aequivalvis, Agrostis canina, Agrostis gigantea, Agrostis stolonifera, Ailanthus altissima, Aira caryophyllea, Aira praecox, Ajuga reptans, Alchemilla arvensis, Alchemilla mollis, Allium cernuum, Allotropa virgata, Alopecurus geniculatus, Amaranthus retroflexus, Ambrosia artemisiifolia, Amelanchier alnifolia, Anemonoides grayi, Angelica lucida, Antennaria howellii, Antennaria neglecta, Anthoxanthum hirtum, Anthoxanthum odoratum, Anthriscus sylvestris, Apocynum androsaemifolium, Aquilegia vulgaris, Arabidopsis thaliana, Arbutus menziesii, Arceuthobium tsugense ssp. contortae, Arceuthobium tsugense ssp. tsugense, Arctium lappa, Arctium minus, Arctostaphylos × media, Arctostaphylos columbiana, Argentina anserina, Argentina pacifica, Artemisia vulgaris, Arum italicum, Aruncus dioicus var. acuminatus, Asarum caudatum, Asparagus officinalis, Aspidotis densa, Asplenium trichomanes, Atocion armeria, Atriplex patula, Atriplex prostrata, Barbarea orthoceras, Barbarea vulgaris, Bellis perennis, Berberis aquifolium, Berberis nervosa, Betula glandulosa, Betula occidentalis, Betula papyrifera, Betula pendula, Bidens amplissima, Bidens cernua, Bidens frondosa, Bidens tripartita, Bolboschoenus maritimus ssp. paludosus, Botrypus virginianus, Boykinia occidentalis, Brasenia schreberi, Brassica oleracea, Brassica rapa, Briza maxima, Bromus carinatus, Bromus diandrus, Bromus inermis, Bromus sitchensis, Bromus sterilis, Bromus tectorum, Bromus vulgaris, Buddleja davidii, Cakile edentula, Calamagrostis canadensis, Callitriche heterophylla var. heterophylla, Callitriche stagnalis, Calluna vulgaris, Calypso bulbosa var. occidentalis, Calystegia sepium, Calystegia silvatica, Camassia quamash, Campanula persicifolia, Campanula rapunculoides, Canadanthus modestus, Capnoides sempervirens, Capsella bursa-pastoris, Cardamine breweri var. orbicularis, Cardamine flexuosa, Cardamine hirsuta, Cardamine oligosperma, Carex aquatilis var. dives, Carex bolanderi, Carex brunnescens ssp. brunnescens, Carex canescens, Carex deweyana, Carex echinata, Carex exsiccata, Carex hendersonii, Carex kelloggii var. kelloggii, Carex kelloggii var. limnophila, Carex laeviculmis, Carex leporina, Carex limosa, Carex luzulina var. ablata, Carex lyngbyei, Carex macrocephala, Carex magellanica ssp. irrigua, Carex obnupta, Carex oederi, Carex pendula, Carex stipata, Carex viridula ssp. viridula, Carex zikae, Castanea sativa, Ceanothus sanguineus, Centaurea cyanus, Centaurea diffusa, Centaurea montana, Centaurea stoebe, Cerastium arvense ssp. strictum, Cerastium glomeratum, Cerastium holosteoides, Cerastium nutans, Cerastium tomentosum, Chenopodium album, Chimaphila menziesii, Cichorium intybus, Cicuta douglasii, Cinna latifolia, Circaea alpina ssp. alpina, Circaea alpina ssp. pacifica, Cirsium arvense, Cirsium vulgare, Claytonia sibirica, Claytonia washingtoniana, Clematis vitalba, Clinopodium douglasii, Clintonia uniflora, Collinsia grandiflora, Collinsia parviflora, Collomia heterophylla, Comarum palustre, Conioselinum gmelinii, Convallaria majalis, Coptis aspleniifolia, Coptis trifolia, Corallorhiza maculata, Corallorhiza striata, Coreopsis lanceolata, Coreopsis tinctoria, Cornus nuttallii, Cornus sericea, Cornus unalaschkensis, Corylus avellana, Corylus cornuta ssp. californica, Cotoneaster bullatus, Cotoneaster coriaceus, Cotoneaster dammeri, Cotoneaster divaricatus, Cotoneaster franchetii, Cotoneaster hjelmqvistii, Cotoneaster horizontalis, Cotoneaster integrifolius, Cotoneaster rehderi, Cotoneaster salicifolius, Cotoneaster simonsii, Cotoneaster sternianus, Cotula coronopifolia, Crataegus douglasii, Crataegus monogyna, Crepis capillaris, Crocosmia × crocosmiiflora, Cymbalaria muralis, Cynosurus echinatus, Cytisus scoparius, Dactylis glomerata, Danthonia spicata, Daphne laureola, Daucus carota, Daucus pusillus, Delphinium menziesii, Dendrolycopodium dendroideum, Deschampsia cespitosa, Dianthus armeria ssp. armeria, Dianthus barbatus, Dichanthelium lanuginosum, Dichanthelium oligosanthes, Digitalis purpurea, Digitaria sanguinalis, Diplotaxis tenuifolia, Dipsacus fullonum, Distichlis spicata, Doronicum pardalianches, Draba verna, Drosera rotundifolia, Dryopteris carthusiana, Dryopteris expansa, Dryopteris filix-mas, Dulichium arundinaceum, Dysphania botrys, Echinochloa crus-galli, Echium vulgare, Eleocharis obtusa, Eleocharis palustris, Eleocharis parvula, Eleocharis uniglumis, Elymus repens, Epilobium ciliatum, Epilobium minutum, Epipactis helleborine, Equisetum fluviatile, Equisetum hyemale ssp. affine, Equisetum telmateia ssp. braunii, Equisetum variegatum, Erigeron annuus, Erigeron canadensis, Eriocoma hymenoides, Eriophorum chamissonis, Eriophyllum lanatum, Erodium cicutarium, Erythranthe alsinoides, Erythranthe guttata, Erythranthe ptilota, Erythronium oregonum, Erythronium revolutum, Eschscholzia californica, Eupatorium cannabinum, Euphorbia cyparissias, Euphorbia myrsinites, Euphorbia peplus, Euphrasia nemorosa, Euthamia graminifolia, Eutrochium maculatum var. bruneri, Festuca bromoides, Festuca microstachys var. pauciflora, Festuca occidentalis, Festuca rubra s. lat., Fragaria × ananassa ssp. cuneifolia, Fragaria vesca ssp. bracteata, Fragaria virginiana, Frangula purshiana, Fritillaria affinis, Fritillaria camschatcensis, Fumaria muralis, Galanthus nivalis, Galeopsis bifida, Galeopsis tetrahit, Galinsoga quadriradiata, Galium aparine, Galium odoratum, Galium trifidum, Galium trifidum ssp. columbianum, Galium triflorum, Gamochaeta ustulata, Gaultheria shallon, Geocaulon lividum, Geranium carolinianum, Geranium macrorrhizum, Geranium molle, Geranium pratense, Geranium pusillum, Geranium robertianum, Geum macrophyllum, Glechoma hederacea, Gnaphalium uliginosum, Goodyera oblongifolia, Grindelia stricta, Gymnocarpium disjunctum, Halerpestes cymbalaria, Hedera helix, Hedera hibernica, Helianthus annuus, Hesperis matronalis, Heuchera micrantha var. diversifolia, Hieracium lachenalii, Hieracium maculatum, Hieracium murorum, Hieracium umbellatum, Holcus lanatus, Holcus mollis, Honckenya peploides ssp. major, Hordeum brachyantherum, Hordeum murinum ssp. murinum, Hordeum vulgare, Humulus lupulus, Huperzia miyoshiana, Huperzia occidentalis, Hyacinthoides hispanica, Hyacinthoides non-scripta, Hypericum anagalloides, Hypericum androsaemum, Hypericum calycinum, Hypericum maculatum, Hypericum perforatum, Hypochaeris glabra, Hypochaeris radicata, Ilex aquifolium, Impatiens capensis, Impatiens glandulifera, Impatiens parviflora, Iris pseudacorus, Isoetes occidentalis, Isolepis cernua, Jacobaea vulgaris, Juglans regia, Juncus acuminatus, Juncus arcticus ssp. alaskanus, Juncus articulatus, Juncus bufonius, Juncus bulbosus, Juncus covillei, Juncus effusus, Juncus ensifolius, Juncus tenuis, Kerria japonica, Kopsiopsis hookeri, Laburnum anagyroides, Lactuca biennis, Lactuca canadensis, Lactuca serriola, Lamium galeobdolon, Lamium purpureum, Lappula occidentalis, Lapsana communis, Lathyrus latifolius, Lathyrus nevadensis, Lathyrus palustris, Lathyrus sylvestris, Lemna minor, Lepidium campestre, Lepidium didymum, Lepidium heterophyllum, Leucanthemum maximum, Leucanthemum vulgare, Leymus mollis ssp. mollis, Ligustrum vulgare, Lilaeopsis occidentalis, Lilium columbianum, Limnanthes douglasii, Limosella aquatica, Linaria dalmatica ssp. dalmatica, Linaria purpurea, Linaria vulgaris, Linnaea borealis ssp. longiflora, Linum usitatissimum, Liriodendron tulipifera, Lobularia maritima, Lolium arundinaceum, Lolium perenne, Lomatium nudicaule, Lonicera ciliosa, Lonicera involucrata var. involucrata, Lotus corniculatus, Lotus pedunculatus, Lunaria annua, Lupinus littoralis, Lupinus polyphyllus ssp. polyphyllus, Luzula comosa var. laxa, Luzula glabrata, Luzula multiflora ssp. multiflora, Lycopodiella inundata, Lycopodium clavatum, Lycopus europaeus, Lycopus uniflorus, Lysimachia europaea, Lysimachia maritima, Lysimachia nummularia, Lysimachia punctata, Lysimachia thyrsiflora, Lythrum salicaria, Madia glomerata, Maianthemum dilatatum, Maianthemum racemosum ssp. amplexicaule, Maianthemum stellatum, Malus fusca, Malva alcea, Malva moschata, Malva neglecta, Matricaria discoidea, Medicago lupulina, Medicago polymorpha, Medicago sativa ssp. sativa, Melilotus albus, Melissa officinalis, Mentha arvensis, Mentha canadensis, Menyanthes trifoliata, Micranthes integrifolia, Micranthes rufidula, Moneses uniflora, Montia fontana, Montia linearis, Muscari armeniacum, Muscari botryoides, Muscari neglectum, Mycelis muralis, Myosotis arvensis, Myosotis laxa, Myosotis scorpioides, Myosotis sylvatica, Myrica gale, Myriophyllum sibiricum, Myrrhis odorata, Nabalus alatus, Nasturtium officinale, Nemophila menziesii, Nemophila parviflora, Nepeta cataria, Nephrophyllidium crista-galli, Nuphar polysepala, Nymphaea odorata ssp. odorata, Oemleria cerasiformis, Oenanthe sarmentosa, Oenothera biennis, Oenothera glazioviana, Origanum vulgare, Osmorhiza berteroi, Oxalis corniculata, Oxalis stricta, Oxybasis rubra, Panicum capillare, Papaver cambricum, Papaver rhoeas, Parnassia palustris, Pastinaca sativa, Persicaria hydropiper, Persicaria hydropiperoides, Persicaria lapathifolia, Persicaria maculosa, Petasites frigidus var. palmatus, Petasites japonicus, Petrosedum forsterianum, Petroselinum crispum, Phalaris arundinacea, Phalaris canariensis, Philadelphus lewisii, Phleum pratense, Physocarpus capitatus, Picea engelmannii, Picea sitchensis, Pilosella aurantiaca, Pilosella caespitosa, Pilosella piloselloides, Pinus contorta var. contorta, Plantago elongata, Plantago lanceolata, Plantago macrocarpa, Plantago major, Plantago maritima, Platanthera elongata, Platanthera orbiculata, Plectritis congesta ssp. brachystemon, Plectritis congesta ssp. congesta, Poa annua, Poa bulbosa ssp. vivipara, Poa compressa, Poa nemoralis, Poa palustris, Poa pratensis, Polygonum aviculare, Polygonum minimum, Polypodium amorphum, Polypodium glycyrrhiza, Polypodium hesperium, Polystichum andersonii, Polystichum braunii, Polystichum braunii × munitum, Populus balsamifera, Populus tremuloides, Populus trichocarpa, Portulaca oleracea, Potamogeton berchtoldii, Potamogeton epihydrus, Potamogeton natans, Potamogeton pusillus ssp. pusillus, Potentilla norvegica, Primula pauciflora var. pauciflora, Prunella vulgaris ssp. lanceolata, Prunella vulgaris ssp. vulgaris, Prunus avium, Prunus cerasifera, Prunus emarginata, Prunus laurocerasus, Prunus lusitanica, Prunus serotina, Prunus virginiana, Pseudofumaria lutea, Pseudognaphalium thermale, Pseudosasa japonica, Pteridium aquilinum var. pubescens, Pterospora andromedea, Puccinellia pumila, Pulmonaria officinalis, Pyrola aphylla, Pyrola chlorantha, Pyrola dentata, Pyrola picta, Quercus robur, Quercus rubra, Ranunculus acris, Ranunculus aquatilis, Ranunculus flammula, Ranunculus repens, Ranunculus uncinatus, Raphanus raphanistrum, Reynoutria × bohemica, Reynoutria japonica, Rhododendron groenlandicum, Rhus glabra, Rhus typhina, Rhynchospora alba, Ribes bracteosum, Ribes divaricatum var. divaricatum, Ribes sanguineum var. sanguineum, Ribes triste, Robinia pseudoacacia, Rorippa curvipes, Rorippa palustris, Rosa gymnocarpa var. gymnocarpa, Rosa multiflora, Rosa nutkana ssp. nutkana, Rosa pisocarpa ssp. pisocarpa, Rosa rubiginosa, Rosa rugosa, Rubus allegheniensis, Rubus bifrons, Rubus chamaemorus, Rubus fruticosus complex, Rubus idaeus ssp. strigosus, Rubus laciniatus, Rubus leucodermis, Rubus nivalis, Rubus pedatus, Rubus ulmifolius, Rubus ursinus, Rubus vestitus, Rumex acetosa, Rumex acetosella, Rumex conglomeratus, Rumex crispus, Rumex maritimus, Rumex obtusifolius, Rumex occidentalis, Ruppia maritima, Sabulina macra, Sagina maxima ssp. crassicaulis, Sagina procumbens, Sagittaria latifolia, Salicornia pacifica, Salix discolor, Salix hookeriana, Salix lasiandra var. lasiandra, Salix purpurea, Salix scouleriana, Salix sitchensis, Sambucus racemosa var. arborescens, Sanguisorba minor, Saponaria officinalis, Sarracenia purpurea ssp. purpurea, Sceptridium multifidum, Scheuchzeria palustris, Schoenoplectus acutus, Schoenoplectus subterminalis, Schoenoplectus tabernaemontani, Scirpus cyperinus, Scirpus microcarpus, Scorzoneroides autumnalis, Scutellaria lateriflora, Secale cereale, Securigera varia, Sedum album, Sedum oreganum, Sedum sexangulare, Selaginella wallacei, Senecio sylvaticus, Senecio viscosus, Senecio vulgaris, Setaria pumila, Setaria viridis, Sidalcea hendersonii, Silene × hampeana, Silene coronaria, Silene dioica, Silene latifolia, Silene vulgaris, Sisymbrium officinale, Sium suave, Solanum dulcamara, Solanum emulans, Solanum nigrum, Solidago canadensis, Solidago elongata, Solidago lepida, Solidago rugosa var. rugosa, Sonchus arvensis ssp. arvensis, Sonchus asper, Sonchus oleraceus, Sorbus aucuparia, Sorbus scopulina var. cascadensis, Sorbus sitchensis var. grayi, Sorbus sitchensis var. sitchensis, Sparganium emersum, Sparganium natans, Spergula arvensis, Spergularia canadensis var. occidentalis, Spergularia macrotheca, Spergularia rubra, Spiraea douglasii, Spiraea japonica, Spiranthes romanzoffiana, Stachys byzantina, Stachys chamissonis var. cooleyae, Stellaria borealis ssp. sitchana, Stellaria crispa, Stellaria humifusa, Stellaria media, Struthiopteris spicant, Symphoricarpos albus var. laevigatus, Symphoricarpos mollis, Symphyotrichum chilense, Symphyotrichum novi-belgii, Symphyotrichum subspicatum, Symphytum officinale, Tanacetum parthenium, Tanacetum vulgare, Tellima grandiflora, Tiarella trifoliata var. laciniata, Tiarella trifoliata var. trifoliata, Tolmiea menziesii, Toxicoscordion venenosum var. venenosum, Tragopogon dubius, Trautvetteria caroliniensis, Trifolium aureum, Trifolium campestre, Trifolium dubium, Trifolium hybridum, Trifolium pratense, Trifolium repens, Trifolium willdenovii, Trifolium wormskioldii, Triglochin maritima, Trillium ovatum var. ovatum, Tripleurospermum inodorum, Trisetum cernuum, Triteleia hyacinthina, Triticum aestivum, Tropaeolum majus, Turritis glabra, Typha × glauca, Typha angustifolia, Typha latifolia, Urtica dioica, Urtica gracilis ssp. gracilis, Utricularia gibba, Utricularia macrorhiza, Utricularia minor, Vaccinium alaskaense, Vaccinium myrtillus, Vaccinium ovatum, Vaccinium oxycoccos, Vaccinium parvifolium, Verbascum blattaria, Verbascum phlomoides, Verbascum thapsus, Veronica americana, Veronica arvensis, Veronica filiformis, Veronica officinalis, Veronica scutellata, Veronica serpyllifolia, Viburnum edule, Vicia cracca, Vicia gigantea, Vicia hirsuta, Vicia sativa, Vinca minor, Viola adunca var. adunca, Viola howellii, Viola odorata, Viola orbiculata, Viola palustris, Viola riviniana, Viola sempervirens, Zannichellia palustris, Zostera marina",
    "CWHds1": "Anemone parviflora, Carex saxatilis, Cassiope tetragona, Cherleria obtusiloba, Dasiphora fruticosa, Diphasiastrum complanatum, Drymocallis glandulosa, Epilobium clavatum, Juncus supiniformis, Melampyrum lineare, Potamogeton foliosus, Potamogeton praelongus, Potentilla recta, Rorippa alpina, Rorippa curvisiliqua, Senecio lugens",
    "CWHms1": "Alchemilla monticola, Carex scoparia, Ceanothus velutinus var. velutinus, Cypripedium montanum, Erythranthe moschata",
    "CWHvm1": "Anemonoides nemorosa, Angelica genuflexa, Arabis eschscholtziana, Barbarea verna",
    "CWHvm2": "Achlys triphylla, Alopecurus pratensis, Arnica cordifolia, Botrychium simplex, Carex macloviana, Carex stylosa, Claytonia exigua ssp. exigua, Cornus sanguinea, Diphasiastrum alpinum × sitchense, Eleocharis mamillata ssp. mamillata, Elymus hirsutus, Epilobium brachycarpum, Epilobium lactiflorum, Fragaria chiloensis, Galium boreale, Gentiana sceptrum, Graphephorum wolfii, Juncus canadensis, Microsteris gracilis, Platanthera unalascensis, Rhinanthus minor, Rhododendron macrophyllum, Sanguisorba officinalis, Sanguisorba stipulata, Shepherdia canadensis, Silene flos-cuculi, Sparganium angustifolium, Spiraea × hitchcockii, Streptopus streptopoides, Trichophorum cespitosum, Trifolium microdon, Trisetum canescens",
    "CWHxm1": "Acer platanoides, Alchemilla australis, Alchemilla occidentalis, Allium amplectens, Allium schoenoprasum, Andromeda polifolia var. polifolia, Anisocarpus madioides, Anthriscus caucalis, Armoracia rusticana, Berberis thunbergii, Brassica napus, Brodiaea coronaria, Bromus hordeaceus, Bromus racemosus, Camassia leichtlinii ssp. suksdorfii, Carex leptopoda, Carex longii, Centranthus ruber, Chelidonium majus, Cirsium brevistylum, Claytonia perfoliata ssp. perfoliata, Claytonia rubra, Cotoneaster dielsianus, Cyclamen hederifolium, Elaeagnus umbellata, Elymus trachycaulus ssp. trachycaulus, Erythranthe microphylla, Festuca myuros, Festuca roemeri, Ficaria verna, Foeniculum vulgare, Fumaria officinalis, Geranium dissectum, Geum urbanum, Glyceria striata, Grindelia hirsutula, Hedera canariensis, Heracleum mantegazzianum, Hordeum jubatum, Iris sibirica, Juniperus maritima, Koeleria macrantha, Leersia oryzoides, Leontodon saxatilis ssp. saxatilis, Lonicera hispidula, Luzula macrantha, Lysimachia arvensis, Madia gracilis, Madia sativa, Malva sylvestris, Melica subulata, Myosotis discolor, Ornithogalum umbellatum, Oxalis oregana, Papaver nudicaule, Pentaglottis sempervirens, Pentagramma triangularis ssp. triangularis, Perideridia gairdneri, Phyllostachys aurea, Platanthera aquilonis, Platanthera elegans, Polygonum paronychia, Polygonum spergulariiforme, Pseudosasa humilis, Pyracantha coccinea, Pyracantha fortuneana, Pyrus communis, Quercus garryana var. garryana, Rudbeckia hirta, Rumex transitorius, Sanicula crassicaulis, Sedum acre, Sedum spathulifolium, Solanum americanum, Spirodela polyrhiza, Teesdalia nudicaulis, Torilis arvensis ssp. arvensis, Trifolium variegatum, Triphysaria pusilla, Ulex europaeus, Verbascum virgatum, Veronica peregrina var. xalapensis, Veronica persica, Vicia americana, Vinca major, Viola affinis",
    "MHmm1": "Arnica mollis, Carex lenticularis var. dolia, Carex livida, Festuca brachyphylla, Festuca saximontana var. saximontana, Gentiana douglasiana, Hippuris montana, Juncus filiformis",
    "MHmm2": "Arnica parryi, Cardamine umbellata, Carex aurea, Carex circinata, Carex microptera, Draba praealta, Dryas drummondii, Erigeron glabellus var. pubescens, Juncus alpinoarticulatus, Luzula parviflora ssp. fastigiata, Micranthes odontoloma, Pilosella tristis, Platanthera dilatata var. leucostachys, Pleuropogon refractus, Poa glauca, Poa leptocoma, Poa paucispicula, Stellaria crassifolia, Veronica alpina?"
  },
  "mapTitle": "Map 1. Ecological communities",
  "regionLabels": {
    "CMAunp": "Coastal Mountain Heather Alpine Zone",
    "CWHdm": "Dry Maritime Coastal Western Hemlock Zone",
    "CWHds1": "Southern Dry Submaritime Coastal Western Hemlock Zone",
    "CWHms1": "Southern Moist Submaritime Coastal Western Hemlock Zone",
    "CWHvm1": "Submontane Very Wet Maritime Coastal Western Hemlock Zone",
    "CWHvm2": "Montane Very Wet Maritime Coastal Western Hemlock Zone",
    "CWHxm1": "Eastern Very Dry Maritime Coastal Western Hemlock Zone",
    "MHmm1": "Windward Moist Maritime Mountain Hemlock Zone",
    "MHmm2": "Leeward Moist Maritime Mountain Hemlock Zone"
  }
}
